tutorials/WALLS/0/init/internalU
internalField   uniform (.8944 .4472 0);
