tutorials/WALLS/0/init/set_init_fields.pyinternalT
// internal Field uniform 273.15;  
internalField nonuniform List<scalar> 
934                                    
(                                     
350
273350
273350
273350
273350
273350
273350
273350
...
)                                     
;