tutorials/WALLS/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 3;
//#include "init/internalp"

boundaryField
{
    inlet
    {
      type     wall;
      value uniform 3;
    }
    outlet
    {
      type     wall;
      value uniform 3;
    }
    left
    {
      type     wall;
      value uniform 3;
    }
    right
    {
      type     wall;
      value uniform 3;
    }
    top
    {
      type     wall;
      value uniform 3;
    }
    bottom
    {
      type     wall;
      value uniform 3;
    }
    defaultFaces
    {
      type            empty;//slip;//wall;
    }
}


// ************************************************************************* //
